<template>
  <Header />
  <Page v-if="advertising" :page="advertising" />
  <Footer />
</template>

<script setup>
  const advertising = {
    title: 'Реклама на Readme',
    text: `<p>Readme предоставляет возможности для размещения рекламы, чтобы ваш бренд или продукт мог достигнуть нашей широкой аудитории пользователей.</p>
      <p><strong>Возможности размещения рекламы</strong></p>
      <p>Мы предлагаем следующие виды рекламы:</p>
      <ul>
        <li><strong>Баннерная реклама:</strong> Размещение баннеров на главной странице или внутренних разделах сервиса Readme.</li>
        <li><strong>Спонсорские публикации:</strong> Создание контента, отмеченного как спонсорская публикация и публикуемого на нашей платформе.</li>
        <li><strong>Рекламные статьи:</strong> Размещение статей или материалов, представляющих ваш продукт или услуги, на нашем сайте.</li>
      </ul>
      <p><strong>Преимущества размещения рекламы на Readme</strong></p>
      <p>Мы предоставляем:</p>
      <ul>
        <li>Доступ к широкой аудитории активных пользователей сервиса.</li>
        <li>Гибкие возможности настройки рекламных кампаний под ваши цели и бюджет.</li>
        <li>Прозрачную отчетность и аналитику для оценки эффективности вашей рекламы.</li>
        <li>Персонализированный подход к вашим рекламным потребностям.</li>
      </ul>
      <p>Если вы заинтересованы в размещении рекламы на нашем сервисе, свяжитесь с нами по адресу advertising@readme.com, и наша команда поможет вам создать эффективную рекламную кампанию, соответствующую вашим целям и потребностям.</p>
      <p>Мы ценим партнерство с вами и готовы помочь вашему бренду достичь успеха на платформе Readme!</p>
      `,
  }
</script>
