<template>
  <Header />
  <Page v-if="job" :page="job" />
  <Footer />
</template>

<script setup>
  const job = {
    title: 'Работа в Readme',
    text: `<p>Мы постоянно ищем талантливых и целеустремленных людей, готовых присоединиться к нашей команде и внести свой вклад в развитие сервиса Readme.</p>
      <p><strong>Вакансии</strong></p>
      <p>У нас открыты следующие вакансии:</p>
      <ul>
        <li><strong>Редактор контента:</strong> Мы ищем креативного и ответственного редактора, способного создавать и редактировать качественный контент для наших пользователей.</li>
        <li><strong>Разработчик программного обеспечения:</strong> Нам нужны опытные разработчики, готовые участвовать в создании новых функций и улучшении производительности сервиса.</li>
        <li><strong>Менеджер по обслуживанию клиентов:</strong> Мы ищем коммуникабельных и дружелюбных специалистов, готовых помогать нашим пользователям и решать их вопросы.</li>
      </ul>
      <p><strong>Преимущества работы в нашей компании</strong></p>
      <p>Мы предлагаем:</p>
      <ul>
        <li>Дружественную и творческую рабочую атмосферу.</li>
        <li>Возможности для профессионального и личностного развития.</li>
        <li>Конкурентоспособную заработную плату и гибкий график работы.</li>
        <li>Возможность внести значимый вклад в развитие и успех нашего сервиса.</li>
      </ul>
      <p>Если вы заинтересованы в работе с нами, отправьте свое резюме на адрес электронной почты careers@readme.com и мы свяжемся с вами, если ваш опыт и навыки будут соответствовать нашим требованиям.</p>
      <p>Мы рады новым талантам и готовы встретить вас в нашей команде Readme!</p>
      `,
  }
</script>
