<template>
  <Page v-if="privacyPolicy" :page="privacyPolicy" />
</template>

<script setup>
  const privacyPolicy = {
    title: 'Политика конфиденциальности',
    text: `<p>Мы ценим вашу конфиденциальность и обязуемся защищать любую личную информацию, которую вы предоставляете при использовании нашего сервиса Readme.</p>
      <p><strong>Собираемая информация:</strong></p>
      <ul>
        <li>Личная информация, предоставляемая вами при регистрации на сервисе, такая как имя, адрес электронной почты и другие контактные данные.</li>
        <li>Информация о вашей деятельности на платформе, такая как публикации, комментарии и взаимодействие с другими пользователями.</li>
        <li>Анонимная информация, собираемая автоматически, включая данные о вашем устройстве и использовании нашего сервиса.</li>
      </ul>
      <p><strong>Использование информации:</strong></p>
      <ul>
        <li>Предоставление и улучшение наших сервисов и функций, а также персонализация вашего опыта.</li>
        <li>Обработка вашей учетной записи, включая управление вашим профилем и взаимодействие с другими пользователями.</li>
        <li>Контроль и анализ тенденций использования, чтобы повысить эффективность нашего сервиса.</li>
      </ul>
      <p><strong>Обмен информацией:</strong></p>
      <p>Мы не продаем, не обмениваем и не передаем личную информацию пользователя третьим сторонам без вашего согласия, за исключением случаев, предусмотренных законом.</p>
      <p><strong>Безопасность информации:</strong></p>
      <p>Мы предпринимаем необходимые меры для защиты вашей личной информации, но не можем гарантировать абсолютную безопасность передачи данных через интернет.</p>
      <p><strong>Изменения в политике конфиденциальности:</strong></p>
      <p>Мы оставляем за собой право вносить изменения в нашу политику конфиденциальности. Любые изменения будут опубликованы на этой странице.</p>
      <p>Используя сервис Readme, вы соглашаетесь с нашей политикой конфиденциальности. Если у вас есть вопросы или требуется дополнительная информация, обращайтесь к нам.</p>
      `,
  }
</script>
