<template>
  <Page v-if="userAgreement" :page="userAgreement" />
</template>

<script setup>
  const userAgreement = {
    title: 'Пользовательское соглашение',
    text: `<p>Пожалуйста, внимательно ознакомьтесь с нашими правилами и условиями использования сервиса Readme. Настоящее соглашение регулирует ваши действия на нашем сервисе и является юридически обязывающим документом.</p>
      <p><strong>1. Правила использования сервиса:</strong></p>
      <p>1.1. Вы соглашаетесь использовать сервис Readme в соответствии с действующими законами и нормами этики.</p>
      <p>1.2. Запрещается размещать контент, нарушающий авторские права, содержащий ненормативную лексику, призывы к насилию, дискриминацию или любые другие формы незаконной деятельности.</p>
      <p>1.3. Вам запрещается публиковать ложную информацию, спам, вредоносный код или любой контент, способный нанести ущерб другим пользователям или самому сервису.</p>
      <p><strong>2. Права и обязанности пользователя:</strong></p>
      <p>2.1. При использовании сервиса Readme вы обязуетесь соблюдать правила и условия, изложенные в настоящем соглашении.</p>
      <p>2.2. Вы обладаете правом создавать и публиковать контент на платформе, при условии его соответствия правилам сервиса.</p>
      <p>2.3. Ваши данные могут быть использованы в соответствии с нашей политикой конфиденциальности, которая является неотъемлемой частью данного соглашения.</p>
      <p><strong>3. Ответственность:</strong></p>
      <p>3.1. Сервис Readme не несет ответственности за контент, созданный пользователями, однако мы оставляем за собой право удалить любой контент, нарушающий правила сервиса.</p>
      <p>3.2. Вы соглашаетесь нести полную ответственность за ваши действия на платформе, включая публикацию контента и взаимодействие с другими пользователями.</p>
      <p>Настоящее пользовательское соглашение вступает в силу с момента начала использования сервиса Readme и остается действительным до момента его расторжения или изменения.</p>
      <p>Пожалуйста, если у вас возникли вопросы по поводу наших условий использования или вам необходима дополнительная информация, обращайтесь к нашей службе поддержки.</p>
      `,
  }
</script>
